import React from 'react';
import Header from '@/components/Header';
import Footer from '@/components/Footer';
import Section from '@/components/Section';

function accessibility() {
  return (
    <main className="main">
      <header className="header" id="top">
        <Header />
      </header>
      <section>
        <Section
          flipped={true}
          title="הצהרת נגישות"
          content='משרדנו נוקט את מירב המאמצים ומשקיע משאבים רבים על מנת לספק לכל לקוחותיו שירות שוויוני, מכובד, נגיש ומקצועי. בהתאם לחוק שוויון זכויות לאנשים עם מוגבלויות תשנ"ח-1998 ולתקנות שהותקנו מכוחו, מושקעים מאמצים ומשאבים רבים בביצוע התאמות הנגישות הנדרשות שיביאו לכך שאדם בעל מוגבלות יוכל לקבל את השירותים הניתנים לכלל הלקוחות, באופן עצמאי ושוויוני.

הסדרי נגישות מבנים
להלן הסדרי הנגישות הקיימים במשרדנו, אשר ממוקמים ביצחק שדה 6, תל אביב :

קיימות חניות נכים ביצחק שדה 6, כולל לרכב גבוה (בתשלום).
קיים רצף גישה מהחניה דרך הכניסה ועד למשרדנו (כולל מעליות).
קיימים שירותי נכים נגישים.
קיימים שלטי זיהוי והכוונה.
מותרת כניסה למשרדנו לחיית שירות המיועדת לסייע לאדם עם מוגבלות.
נגישות אתר האינטרנט
אתר אינטרנט נגיש הוא אתר המאפשר לאנשים עם מוגבלות ולאנשים מבוגרים לגלוש באותה רמה של יעילות והנאה ככל הגולשים.
משרדנו מאמין ופועל למען שוויון הזדמנויות במרחב האינטרנטי לבעלי לקויות מגוונות ואנשים הנעזרים בטכנולוגיה מסייעת לשימוש במחשב.

מידע על נגישות האתר:
אתר זה עומד בדרישות תקנות שוויון זכויות לאנשים עם מוגבלות (התאמות נגישות לשירות), התשע"ג 2013.
התאמות הנגישות בוצעו עפ"י התקן הישראלי (ת"י 5568) לנגישות תכנים באינטרנט ברמת AA ומסמך WCAG2.0 הבינלאומי.
הבדיקות נבחנו לתאימות הגבוהה ביותר עבור דפדפן כרום.
האתר מספק מבנה סמנטי עבור טכנולוגיות מסייעות ותמיכה בדפוס השימוש המקובל להפעלה עם מקלדת בעזרת מקשי החיצים, Enter ו- Esc ליציאה מתפריטים וחלונות.
מותאם לתצוגה בדפדפנים הנפוצים ולשימוש בטלפון הסלולרי.
לשם קבלת חווית גלישה מיטבית עם תוכנת הקראת מסך, אנו ממליצים לשימוש בתוכנת NVDA העדכנית ביותר.'
        />
      </section>
      <footer>
        <Footer />
      </footer>
    </main>
  );
}

export default accessibility;
